Repository: AsherBond/openstack-manuals
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: Rewrote the host-side script in Python. The new main script is called ``st.py``. The old bash script, ``osbash.sh``, remains available and supported.
id: Rewrote script sisi host dengan Python. Skrip utama baru disebut ``st.py``. Script bash lama, ``osbash.sh``, tetap tersedia dan didukung.

source: Rocky release
id: Rilis Rocky

source: Stability improvements:
id: perbaikan stabilitas:

source: Support for the new OpenStack release will be available shortly after the release of Pike.
id: Dukungan untuk rilis OpenStack baru akan segera tersedia setelah Pike rilis

source: Test coverage:
id: Cakupan uji:

source: The **Admin User Guide** content has been removed from `OpenStack Docs <https://docs.openstack.org>`_ since all files have been reorganised into the **Administrator Guide**.
id: Isi **Admin User Guide** telah dihapus dari `OpenStack Docs <https://docs.openstack.org>`_ karena semua file telah direorganisasi ke dalam **Administrator Guide**.

source: The API reference documentation has been moved from the api-site repository to project specific repositories. The collection of API docs is now available on the `OpenStack API Documentation <https://developer.openstack.org/api-guide/quick-start/>`_.
id: Dokumentasi referensi API telah dipindahkan dari repositori api-site ke repositori spesifik proyek. Koleksi API docs sekarang tersedia di `OpenStack API Documentation <https://developer.openstack.org/api-guide/quick-start/>`_.

source: The Installation Guide has been renamed to Installation Tutorial, and now includes Container Infrastructure Management service (magnum), Messaging service (zaqar), Key Manager service (barbican), and Bare Metal service (ironic).
id: Installation Guide telah diubah namanya menjadi Installation Tutorial, dan sekarang termasuk layanan Container Infrastructure Management (magnum), layanan Messaging (zaqar), layanan Key Manager (barbican), dan layanan Bare Metal (ironis).

source: The Installation Tutorial can now publish documentation from project specific repositories.
id: Installation Tutorial sekarang dapat mempublikasikan dokumentasi dari repositori proyek tertentu.

source: The Operations Guide is in the process of being migrated to the OpenStack wiki. It is unavailable on docs.openstack.org from Pike.
id: Operations Guide sedang dalam proses dimigrasikan ke wiki OpenStack. Tidak tersedia di docs.openstack.org dari Pike.

source: The Operations Guide is now using RST as source format. This completes the transition to RST, and the old DocBook tools have been retired.
id: Operations Guide sekarang menggunakan RST sebagai format sumber. Ini melengkapi transisi ke RST, dan alat-alat DocBook lama yang telah pensiun.

source: The `Compute API <https://developer.openstack.org/api-ref/compute/>`_ and `DNS API <https://developer.openstack.org/api-ref/dns/>`__ sites offer great examples of the new API reference, maintained by the project team rather than a central docs team.
id: Situs `Compute API <https://developer.openstack.org/api-ref/compute/>`_ dan `DNS API <https://developer.openstack.org/api-ref/dns/>`__ menawarkan contoh besar dari referensi API baru, yang dikelola oleh tim proyek daripada tim docs pusat.

source: The ``ha-guide`` repository was restored and is now owned by the Operations Documentation SIG. The source of the High Availability Guide was moved from ``openstack-manuals`` to that repository.
id: Repositori `` ha-guide`` telah dipulihkan dan sekarang dimiliki oleh Operations Documentation SIG. Sumber dari High Availability Guide dipindahkan dari ``openstack-manuals`` ke repositori itu.

source: The ``operations-guide`` repository was restored and is now owned by the Operations Documentation SIG. The source of the Operations Guide was moved from ``openstack-manuals`` to that repository.
id: Repositori `` operations-guide`` telah dipulihkan dan sekarang dimiliki oleh Operations Documentation SIG. Sumber Operations Guide telah dipindahkan dari ``openstack-manuals`` ke repositori itu.

source: The content of the separate repositories operations-guide and ha-guide has been moved into the openstack-manuals repository. The operations-guide and ha-guide repositories have been retired.
id: Isi dari repositori terpisah untuk operations-guide dan ha-guide telah dipindahkan ke repositori OpenStack-manual. Repositori operations-guide dan ha-guide telah pensiun.

source: The documentation sites ``developer.openstack.org`` and ``docs.openstack.org`` are now using ``https`` and links to pages have been changed to use ``https`` by default.
id: Situs dokumentasi ``developer.openstack.org`` dan `` docs.openstack.org`` sekarang menggunakan ``https`` dan link ke halaman telah diubah untuk menggunakan ``https`` secara default.

source: These release notes cover all aspects of the work of the documentation team with the exception of those repositories that have their own release notes (currently openstackdocstheme and openstack-doc-tools). Thus this file covers the content of the following repositories:
id: Catatan rilis ini mencakup semua aspek pekerjaan dari tim dokumentasi dengan pengecualian kedua repositori yang memiliki catatan rilis mereka sendiri (saat openstackdocstheme dan OpenStack-doc-tools). Sehingga file ini meliputi isi dari repositori berikut:

source: This delay is intentional, to let the distribution packages stabilize, and to ensure all test cases and reliability checks meet certain criteria.
id: Penundaan ini disengaja, untuk membiarkan paket distribusi stabil, dan untuk memastikan semua kasus uji (test case) dan pemeriksaan keandalan memenuhi kriteria tertentu.

source: This is a new document that aims to provide common documentation for all OpenStack Contributors and help with on-boarding efforts.
id: Ini adalah dokumen baru yang bertujuan untuk menyediakan dokumentasi umum untuk semua Kontributor OpenStack dan membantu upaya on-boarding.

source: Training cluster should additionally have higher deployment rate.
id: Klaster pelatihan harus memiliki tambahan tingkat pengerahan yang lebih tinggi.

source: Training guides
id: Panduan pelatihan

source: Training labs
id: Laboratorium pelatihan

source: Training labs landing page is published under `docs.openstack.org <https://docs.openstack.org/training_labs/>`_:
id: Training labs landing page ini diterbitkan di bawah `docs.openstack.org <https://docs.openstack.org/training_labs/>`_:

source: Translations
id: terjemahan

source: Troubleshooting chapters now have consistent formatting, which is a step toward improved troubleshooting sections.
id: Cara mengatasi masalah bab ini menggunakan format yang konsisten, dimana cara ini akan memperbaiki sektor pemecahan masalah.

source: URL and file names changed to use only hyphens for consistency and search engine optimization.
id: URL dan nama file diubah untuk menggunakan hanya tanda hubung (hyphen) untuk konsistensi dan optimasi mesin pencari.

source: Update Huawei cinder driver configuration to remove the redundant configuration and add new features and storage system that Huawei cinder driver support.
id: Update konfigurasi driver cinder Huawei untuk menghapus konfigurasi yang berlebihan dan menambahkan fitur dan sistem penyimpanan baru yang didukung oleh driver cinder Huawei.

source: Updated Installation Guides RST with new syntax changes.
id: Installation Guides RST diperbarui dengan perubahan sintaks baru.

source: Updated OpenStack command-line client commands to OpenStackClient commands.
id: Diperbaharui perintah klien command-line OpenStack ke perintah OpenStackClient.

source: Updated command examples for accuracy and parity with latest versions.
id: Diperbaharui contoh perintah untuk ketepatan dan kesetaraan dengan versi terbaru.

source: Updated configuration for all services.
id: Konfigurasi terupdate untuk semua layanan.

source: Updated for changes with regard to migrating documentation from openstack-manuals to project team repositories.
id: Diperbarui untuk perubahan berkaitan dengan dokumentasi migrasi dari openstack-manual ke repositori tim proyek.

source: Updated glossary terms for Nginx, SPICE, Data Loss Prevention (DLP), Trusted Platform Module (TPM), Secure Boot, and other acronyms.
id: Diperbaharui istilah glossary untuk Nginx, SPICE, Data Loss Prevention (DLP), Trusted Platform Module (TPM), Secure Boot, dan akronim lainnya.

source: Updated graphics advice.
id: Diperbaharui saran grafis.

source: Updated guide to be relevant for updated openstack-manuals.
id: Panduan yang diperbarui relevan untuk manual openstack yang diperbarui.

source: Updated identity and compute content - PCI DSS v3.1 compliance, and Huge Page functionality, respectively.
id: Diperbarui identitas dan komputasi konten - PCI DSS v3.1 compliance, dan fungsi Huge Page, masing-masing.

source: Updated landing page to improve ease of use.
id: Update landing page untuk meningkatkan kemudahan penggunaan.

source: Updated the `Contributor Guide <https://docs.openstack.org/doc-contrib-guide/api-guides.html>`__ to include specific API Guides information.
id: Diperbarui `Contributor Guide <https://docs.openstack.org/doc-contrib-guide/api-guides.html>`__ untuk menyertakan informasi API Guidesyang spesifik.

source: Updated the landing page at `developer.openstack.org <https://developer.openstack.org/>`_ to point to development environments, "Writing your first OpenStack application," and application reference architectures.
id: Memperbarui landing page di `developer.openstack.org <https://developer.openstack.org/>`_ untuk mengarahkan lingkungan pengembangan, "Writing your first OpenStack application," dan arsitektur referensi aplikasi.

source: Updated the user interface text guidelines.
id: Diperbaharui pedoman teks antarmuka pengguna.

source: Updates for supporting new operating systems. For example, Ubuntu 16.04.
id: Pembaruan untuk mendukung sistem operasi baru. Misalnya, Ubuntu 16.04.

source: Updates to compliance section around audit phases and links.
id: Memperbaharui bagian kepatuhan (compliance) sekitar tahapan audit dan link.

source: Updates to the CLI along with many improvements to address new features.
id: Update ke CLI bersama dengan banyak perbaikan untuk mengatasi fitur baru.

source: User guides
id: Panduan pengguna

source: User interface test cases to check the availability of horizon have been implemented.
id: Kasus pengujian antarmuka user untuk memeriksa ketersediaan horizon telah dilaksanakan.

source: User visible changes
id: Perubahan pengguna terlihat

source: Users can download zip/tar files for Windows, Linux and Mac OS X platforms for supported releases.
id: Pengguna dapat men-download file zip/tar untuk platform Windows, Linux dan Mac OS X untuk rilis yang didukung.

source: Various bug fixes and minor improvements in the host scripts.
id: Berbagai perbaikan bug dan perbaikan kecil pada skrip host.

source: Various fixes such as grammar and incorrect hyperlinks
id: Berbagai perbaikan seperti tata bahasa dan hyperlink yang salah

source: Various stability improvements have been added in this release.
id: Berbagai perbaikan stabilitas telah ditambahkan dalam rilis ini.

source: Windows platform support has been updated and improved.
id: Dukungan platform Windows telah diperbarui dan diperbaiki.

source: [DE] Added Security Guide, Installation Guide, I18n Guide, and FirstApp API Guide
id: [DE] Added Security Guide, Installation Guide, I18n Guide, dan FirstApp API Guide

source: `API Quick Start <https://developer.openstack.org/api-guide/quick-start/>`_ converted to RST with theme styling to match.
id: `API Quick Start <https://developer.openstack.org/api-guide/quick-start/>`_ dikonversi ke RST dengan tema styling untuk mencocokkan.

source: `Compute API Guide <https://developer.openstack.org/api-guide/compute/>`_ now built from nova source tree.
id: `Compute API Guide <https://developer.openstack.org/api-guide/compute/>`_ sekarang dibangun dari nova source tree.

source: contributor-guide
id: contributor-guide (kontributor-panduan)
