Repository: AsherBond/openstack-manuals
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: id

source: A revised Architecture Design Guide is currently under development, no changes to the current guide.
id: Sebuah Architecture Design Guide yang direvisi saat ini sedang dalam pengembangan, tidak ada perubahan untuk panduan saat ini.

source: API guides
id: Panduan API

source: Added BGP dynamic routing.
id: Ditambahkan routing dinamis BGP.

source: Added DPDK for Open vSwitch.
id: Ditambahkan DPDK untuk Open vSwitch.

source: Added Database service (trove) content.
id: Tambah konten Database (harta).

source: Added OSSNs 0063, 0066, 0068, 0069, 0073.
id: Ditembahkan OSSNs 0063, 0066, 0068, 0069, 0073.

source: Added RBAC.
id: Ditambahkan RBAC.

source: Added RFC 5737 and 3849 compliance policy.
id: Ditambahkan kebijakan kepatuhan RFC 5737 dan 3849

source: Added Redis replication information and Rootwrap Daemon configuration information to the Administrator Guide.
id: Ditambahkan informasi replikasi Redis dan informasi konfigurasi Rootwrap Daemon ke Administrator Guide.

source: Added Shared File Systems (manila) content.
id: Tambah konten Shared File Systems (manila).

source: Added VLAN trunking.
id: Ditambahkan VLAN trunking.

source: Added a new 2017/2018 documentation team vision document.
id: Menambahkan dokumen visi tim dokumentasi 2017/2018 yang baru.

source: Added address scopes.
id: Ditambahkan lingkup alamat (address scope)

source: Added build tools so that the Security Guide can be built both separately and with the OSSN and TA sections.
id: Ditambahkan alat pembangunan sehingga Security Guide dapat dibangun dengan bagian OSSN dan TA secara bersamaan ataupun secara terpisah.

source: Added content about building documentation from end-of-life releases.
id: Ditambahkan konten tentang membangun dokumentasi dari rilis end-of-hidup.

source: Added content about the new release process.
id: Menambahkan konten tentang proses rilis baru.

source: Added custom exceptions.
id: Ditambahkan pengecualian khusus.

source: Added enterprise operations documentation including RabbitMQ troubleshooting information, instructions to retrieve lost IP addresses, and procedures to manage floating IP addresses between instances.
id: Ditambahkan dokumentasi operasi perusahaan termasuk informasi tip menatasi masalah RabbitMQ, petunjuk untuk mengambil (retrieve) alamat IP yang hilang, dan prosedur untuk mengelola alamat IP mengambang antar instance.

source: Added information about creating project-specific Installation Tutorials.
id: Ditambahkan informasi tentang pembuatan Installation Tutorials untuk project-specific.

source: Added links to upgrade documentation for nova, keystone, cinder, glance, swift, and ceilometer.
id: Ditambahkan link untuk meng-upgrade dokumentasi untuk nova, keystone, cinder, glance, swift, dan ceilometer.

source: Added more tests to ``repeat_test`` scripts.
id: Ditambahkan lebih banyak tes untuk skrip ``repeat_test``.

source: Added new chapters in the draft Training Guides
id: Menambahkan bab baru dalam draft Training Guides

source: Added personas content to the user experience section.
id: Ditambahkan konten pribadi ke bagian pengalaman pengguna.

source: Added routed provider networks.
id: Ditambahkan jaringan provider di-rute.

source: Added section regarding automated instance recovery.
id: Ditambahkan bagian mengenai pemulihan instance otomatis.

source: Added senlin, monasca, and cloudkitty clients.
id: Tambahkan senlin, monasca, dan klien cloudkitty.

source: Added service function chaining.
id: Ditambahkan service function chaining (sfc)

source: Added service subnets.
id: Ditambahkan subnet layanan.

source: Added subnet pools.
id: Ditambahkan kolam subnet

source: Added the Shared File Systems chapter.
id: Tambah bab ini Shared File Systems.

source: Added the `Highly available Shared File Systems API <https://docs.openstack.org/ha-guide/storage-ha-file-systems.html>`_ section.
id: Ditambahkan bagian `Highly available Shared File Systems API <https://docs.openstack.org/ha-guide/storage-ha-file-systems.html>`_.

source: Added the `MariaDB Galera cluster <https://docs.openstack.org/ha-guide/shared-database.html>`_ installation, configuration, and management details.
id: Ditambahkan `MariaDB Galera cluster <https://docs.openstack.org/ha-guide/shared-database.html>`_ rincian instalasi, konfigurasi, dan manajemen.

source: Added the `Upstream Training Archives <https://docs.openstack.org/upstream-training/upstream-archives.html>`_ (the list of past global and local Upstream Training events).
id: Ditambahkan `Upstream Training Archives <https://docs.openstack.org/upstream-training/upstream-archives.html>`_ (Daftar kejadian Upstream Training global dan lokal masa lalu).

source: Added the bug report links to each slide and the landing page.
id: Ditambahkan link laporan bug untuk setiap slide dan halaman arahan.

source: Adds support for x86/i386 architecture.
id: Menambahkan dukungan untuk arsitektur x86/i386.

source: Administrator Guide
id: Administrator Guide (panduan administrator)

source: All of the documentation builds (except for release notes and the api-ref) have been combined so that each repository has a single ``doc/source`` directory, a single sphinx ``conf.py``, and a single job for building and publishing the content including developer, contributor, and user documentation.
id: Semua dokumentasi dibangun (kecuali untuk catatan rilis dan api-ref) telah digabungkan sehingga masing-masing repositori memiliki direktori ``doc/source`` tunggal, satu sphinx ``conf.py``, dan satu pekerjaan untuk membangun dan menerbitkan konten termasuk dokumentasi pengembang, kontributor, dan pengguna.

source: Approximately one third of the **Administrator Guide** chapters received a thorough edit for style and consistency, following the contributor guide standard.
id: Sekitar sepertiga dari bab **Administrator Guide** menerima peneditan menyeluruh untuk gaya dan konsistensi, mengikuti standar panduan kontributor.

source: Architecture design guide
id: Panduan desain arsitektur

source: As of the Pike release, the complete documentation suite that resided within the openstack-manuals repository has been reworked, and the content of the following guides has been moved to the project team repositories:
id: Pada Pike rilis, suite dokumentasi lengkap yang berada di dalam repositori openstack-manuals telah selesai dikerjakan, dan isi panduan berikut telah dipindahkan ke repositori tim proyek:

source: Assorted updates and cleanups.
id: Berbagai macam pembaharuan dan pembersihan.

source: Available from the `OpenStack Contributor Guide <https://docs.openstack.org/contributors/>`_.
id: Tersedia dari `OpenStack Contributor Guide <https://docs.openstack.org/contributors/>`_.

source: Available from the `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/>`_.
id: Tersedia dari `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/>`_.

source: Available from the `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/>`_.
id: Tersedia dari `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/>`_.

source: Available from the `OpenStack Operations Guide <https://docs.openstack.org/operations-guide/>`_.
id: Tersedia dari `OpenStack Operations Guide <https://docs.openstack.org/operations-guide/>`_.

source: Besides updating the existing translated manuals, the Internationalization (i18n) team added the following new manuals:
id: Selain memperbarui manual terjemahan yang ada, tim Internationalization (i18n) menambahkan manual baru berikut ini:

source: Besides updating the existing translated manuals, the internationalization team added the following new manuals:
id: Selain memperbarui manual yang diterjemahkan yang ada, tim internasionalisasi menambahkan manual baru berikut:

source: Block storage (cinder) has a dedicated disk as opposed to being file mounted as a loop device. This should improve performance and provide persistence for cinder-volumes across reboots.
id: Block storage (cinder) memiliki disk dedikasi sebagai lawan dari menjadi file yang di-mount sebagai perangkat loop. Disk dediksi ini harus meningkatkan kinerja dan memberikan keeratan (persisten) untuk cinder-volume di reboot.

source: Built draft swagger files.
id: Dibangun rancangan file angkuh (swagger file).

source: Changes to swift content on ``.rlistings``, and neutron dnsmasq log file content.
id: Perubahan konten swift pada ``.rlistings``, dan konten file log neutron dnsmasq

source: Cluster setup speed is improving after addition of multiple features.
id: Kecepatan penyiapan kluster membaik setelah penambahan beberapa fitur.

source: Collected the user experience content in a single section.
id: Terkumpul konten pengalaman pengguna dalam satu bagian.

source: Command-Line Interface Reference abandons the `openstack` command reference in favor of the reference in the OpenStackClient repository.
id: Command-Line Interface Reference meninggalkan referensi perintah `openstack` yang mendukung referensi dalam repository OpenStackClient.

source: Completed `API Documentation <https://specs.openstack.org/openstack/api-wg/guidelines/api-docs.html>`__ guidelines with the API Working Group.
id: Pedoman lengkap `API Documentation <https://specs.openstack.org/openstack/api-wg/guidelines/api-docs.html>`__ dengan API Working Group.

source: Completely restructured the guide.
id: Hasil restrukturisasi lengkap sebagai panduan.

source: Configuration Reference consolidates the common configurations such as database connections and RPC messaging.
id: Configuration Reference mengkonsolidasikan konfigurasi umum seperti koneksi database dan pesan RPC.

source: Configuration Reference supports the Application Catalog service.
id: Configuration Reference mendukung layanan Application Catalog.

source: Configured infrastructure to parse and run Labs with auto-generated bash scripts. This is currently an unstable prototype.
id: Infrastruktur yang dikonfigurasi untuk mengurai dan menjalankan Labs dengan skrip bash yang dihasilkan secara otomatis. Ini saat ini merupakan prototipe yang tidak stabil.

source: Contributor Guide
id: Contributor Guide (panduan kontributor)

source: Contributor guide
id: Panduan kontributor

source: Created `cookiecutter <https://opendev.org/openstack/installguide-cookiecutter/>`_ tool to ensure project specific guides have a consistent structure.
id: Dibuat `cookiecutter <https://opendev.org/openstack/installguide-cookiecutter/>`_ alat untuk memastikan panduan spesifik proyek memiliki struktur yang konsisten.

source: Created new section for project-specific Deployment Guides (guides for using automated installation tools).
id: Buat bagian baru untuk Deployment Guides khusus proyek (panduan untuk menggunakan alat penginstalan otomatis).

source: Created sections for newly added vendor plug-ins for Ocata.
id: Bagian yang dibuat untuk plug-in vendor yang baru ditambahkan untuk Ocata.

source: Created templates for writing API guides for projects teams available in projects repositories.
id: Template yang dibuat untuk menulis panduan API tim proyek tersedia dalam repositori proyek.

source: Created the repository and pushed initial code from GitHub domain.
id: Membuat repositori dan memasukkan kode awal dari domain GitHub.

source: Deleted references to default flavors.
id: Dihapus referensi ke default flavor.

source: Deployment Guides
id: Deployment Guides (panduan pengerahan)

source: Documentation Contributor Guide
id: Panduan Kontributor Dokumentasi

source: Documentation of some of the new features in Mitaka.
id: Dokumentasi beberapa fitur baru di Mitaka.

source: Documentation team release notes
id: Dokumentasi catatan rilis tim

source: Documented Message service (zaqar).
id: Layanan Documented Message (zaqar).

source: Documented that individual CLIs are deprecated in favor of the common OpenStack client.
id: Didokumentasikan bahwa CLI individu usang dalam mendukung OpenStack client umum.

source: Documented the `Pacemaker cluster manager <https://docs.openstack.org/ha-guide/intro-ha-arch-pacemaker.html>`_ and Keepalived architecture details and limitations.
id: Didokumentasikan `Pacemaker cluster manager <https://docs.openstack.org/ha-guide/intro-ha-arch-pacemaker.html>`_ dan rincian arsitektur Keepalived dan keterbatasannya.

source: Enabled translation.
id: Terjemahan diaktifkan

source: End User Guide
id: End User Guide (panduan end user)

source: General bug fixes and updates.
id: Secara umum perbaikan bug dan update.

source: General updates to the Upgrades chapter.
id: Pembaruan umum untuk bab Upgrade.

source: German
id: Jerman

source: Glossary reorganized to support ease of access for users.
id: Glossary diorganisasi kembali untuk mendukung kemudahan akses bagi pengguna.

source: High availability guide
id: Panduan ketersediaan tinggi (high availability)

source: Improved DNS resolution.
id: Peningkatan resolusi DNS.

source: Improved Load-Balancer-as-a-Service.
id: Peningkatan Load-Balancer-as-a-Service.

source: Improved MTU considerations.
id: Peningkatan MTU considerations.

source: Improved Open vSwitch HA DVR deployment.
id: Peningkatan pengerahan Open vSwitch HA DVR.

source: Improved SR-IOV.
id: Ditingkatkan SR-IOV.

source: Improved `Pacemaker/Corosync cluster <https://docs.openstack.org/ha-guide/controller-ha-pacemaker.html>`_ installation and configuration details.
id: Diperbaiki rincian instalasi dan konfigurasi `Pacemaker/Corosync cluster <https://docs.openstack.org/ha-guide/controller-ha-pacemaker.html>`_

source: Improved address scopes.
id: ditingkatkan cakupan alamat (address scope)

source: Improved and restructured `Upstream Training <https://docs.openstack.org/upstream-training/>`_
id: Diperbaiki dan direstrukturisasi `Upstream Training <https://docs.openstack.org/upstream-training/>`_

source: Improved feature to link exceptions to the exact location in the source RST file.
id: Fitur yang disempurnakan untuk menghubungkan pengecualian ke lokasi yang tepat di file sumber RST.

source: Improved high-availability for DHCP.
id: Peningkatan high-availability untuk DHCP.

source: Improved logging configuration.
id: Konfigurasi logging yang lebih baik.

source: Improved security groups.
id: Ditingkatkan kelompok keamanan (security group).

source: Improved service subnets.
id: Peningkatan service subnets.

source: Improved terminal output with colors and better formatting of the messages.
id: Peningkatan keluaran terminal dengan warna dan format pesan yang lebih baik.

source: Improved the `RabbitMQ section <https://docs.openstack.org/ha-guide/shared-messaging.html>`_.
id: Diperbaiki `RabbitMQ section <https://docs.openstack.org/ha-guide/shared-messaging.html>`_.

source: Improvements in networking related challenges.
id: Perbaikan jaringan yang terkait dengan tantangan.

source: Improvements to the library scripts.
id: Perbaikan skrip perpustakaan.

source: Installation Tutorials and Guides
id: Tutorial Instalasi dan Panduan

source: Installation guide
id: Petunjuk instal

source: Internal changes
id: perubahan internal

source: Japanese
id: Jepang

source: KVM/Libvirt backends now use shared storage. Hard disks for the cluster are diffs on top of the base disk. This uses less storage space.
id: Backend KVM/Libvirt sekarang menggunakan penyimpanan bersama. Hard disk untuk cluster yang diffs di atas dasar disk. Ini menggunakan ruang penyimpanan berkurang.

source: Korean
id: Korea

source: Migrated content on configuring and customizing the Dashboard, previously maintained in the Configuration Reference, to the Dashboard chapter of the Administrator Guide.
id: Dimirgasikan konten tentang konfigurasi dan menyesuaikan Dashboard, dimana sebelumnya dipelihara di Configuration Reference, sekarang ke bab Dashboard dari Administrator Guide.

source: Migrated examples from deprecated Identity service (keystone) direct driver loading examples to stevedore.
id: Contoh dimigrasikan dari contoh pemuatan drive langsung layanan Identity (keystone) yang telah usang ke stevedore (pemuat kuli pelabuhan)

source: Networking guide
id: Panduan Networking

source: New content including documentation for LBaaS, DNS integration, and macvtap ml2 driver.
id: Konten baru termasuk dokumentasi untuk LBaaS, integrasi DNS, dan macvtap ml2 driver.

source: New section on rate-limiting and API endpoint traffic.
id: Bagian baru pada lalu lintas rate-limiting dan API endpoint.

source: New, cleaner `developer.openstack.org <https://developer.openstack.org>`_ landing page.
id: Baru, bersih `developer.openstack.org <https://developer.openstack.org>`_ landing page.

source: Newton release
id: Rilis Newton

source: Newton support should be available shortly after the OpenStack release.
id: Dukungan Newton harus segera tersedia setelah rilis OpenStack.

source: Newton support:
id: Dukungan Newton:

source: Ocata release
id: Ocata rilis

source: Ocata support will be available shortly after the Ocata release date. This delay is intentional, to let the distribution packages stabilize, and to ensure all test cases and reliability checks meet criteria.
id: Dukungan Ocata akan segera tersedia setelah tanggal rilis Ocata. Penundaan ini disengaja, agar paket distribusi stabil, dan untuk memastikan semua uji kasus dan pemeriksaan reliabilitas memenuhi kriteria.

source: OpenStack High Availability Guide
id: Panduan OpenStack High Availability

source: OpenStack Operations Guide
id: Panduan Operasi OpenStack

source: OpenStack-Ansible Deployment guide created.
id: Panduan OpenStack-Ansible Deployment dibuat.

source: Operations guide
id: Panduan operasi

source: PXE boot could also be used as a mechanism for provisioning KVM/VirtualBox based workloads.
id: Boot PXE juga bisa digunakan sebagai mekanisme untuk penyediaan KVM/VirtualBox berdasarkan beban kerja.

source: PXE booting functionality is available as a pluggable driver in parallel with KVM/VirtualBox.
id: Fungsi booting PXE tersedia sebagai pluggable driver secara paralel dengan KVM/VirtualBox.

source: PXE feature for training-labs:
id: Fitur PXE untuk training-labs (pelatihan-laboratorium):

source: Performance improvements by fixing race conditions occurring due to virtualization overhead.
id: Peningkatan kinerja dengan memperbaiki terjadi kondisi bergegas karena berlebihan (overhead) virtualisasi.

source: Performance improvements:
id: Perbaikan kinerja:

source: Pike release
id: Pike rilis

source: Provide details for contacting the OpenStack HA community.
id: Memberikan rincian untuk menghubungi komunitas OpenStack HA.

source: Published API Guide.
id: Published API Guide (panduan API yang diterbitkan)

source: Published End User Guide.
id: Panduan End User yang dipublikasikan.

source: Published Installation Tutorials for Mitaka.
id: Published Installation Tutorials for Mitaka (tutorial instalasi untuk Mitaka yang diterbitkan).

source: Published Installation Tutorials for Newton.
id: Tutorial Instalasi yang dipublikasikan untuk Newton.

source: Published Networking Guide.
id: Published Networking Guide (panduan jaringan yang diterbitkan)

source: Published project specific guides for Container Infrastructure Management service (magnum), Messaging service (zaqar), Key Manager service (barbican), and Bare Metal service (ironic).
id: Diterbitkan panduan proyek tertentu untuk layanan Container Infrastructure Management (magnum), layanan Messaging (zaqar), layanan Key Manager (barbican), dan layanan Bare Metal (ironis).

source: Published the Networking Guide.
id: Diterbitkan Panduan Jaringan.

source: Published the Upstream Training.
id: Diterbitkan Pelatihan Hulu.

source: Readability changes for links, images, and document format.
id: Perubahan yang dapat dibaca untuk link, image, dan format dokumen.

source: Released fairy-slipper, a migration tool for WADL to RST plus API reference information.
id: Dirilis fairy-slipper, alat migrasi untuk WADL ke RST ditambah informasi referensi API.

source: Removed Keepalived architecture as it is no longer advocated.
id: Dihapus arsitektur Keepalived karena tidak lagi dianjurkan.

source: Removed content that is not specifically configuration options.
id: Dihapus konten yang tidak secara khusus pilihan konfigurasi.

source: Removed instructions to install DevStack and information on contributing to OpenStack, which is documented on the DevStack project website and Infrastructure Manual respectively.
id: Telah dihapus instruksi untuk menginstal DevStack dan informasi kontribusi untuk OpenStack, dimana keduanya didokumentasikan di situs proyek DevStack dan Infrastructure Manual masing-masing.

source: Removed legacy commands in favor of the ``openstack`` client commands where equivalent functions existed.
id: Menghapus perintah lawas yang mendukung perintah ``openstack`` di mana ada fungsi yang setara.

source: Removed legacy commands in favor of the ``openstack`` client commands where equivalent functions existed. Legacy commands changed include ``nova``, ``neutron``, ``cinder``, ``glance``, ``keystone``, and ``manila`` clients.
id: Menghapus perintah lawas yang mendukung perintah ``openstack`` di mana ada fungsi yang setara. Perintah lawas diubah termasuk klien ``nova``, ``neutron``, ``cinder``, ``glance``, ``keystone``, dan ``manila``.

source: Removed legacy commands in favor of the ``openstack`` client commands where equivalent functions existed. Legacy commands changed include ``sahara``.
id: Menghapus perintah lawas yang mendukung perintah ``openstack`` di mana ada fungsi yang setara. Perintah lawas diubah termasuk ``sahara``.

source: Removed tuskar client because of retirement.
id: Dihapus klien Tuskar karena pensiun.

source: Renamed from Contributor Guide to Documentation Contributor Guide to distinguish this document from the new document aimed at all new OpenStack contributors.
id: Berganti nama dari Contributor Guide ke Documentation Contributor Guide untuk membedakan dokumen ini dari dokumen baru yang ditujukan untuk semua kontributor OpenStack baru.

source: Renamed to Installation Tutorial.
id: Berganti nama menjadi Installation Tutorial.

source: Reorganised the **Admin User Guide** content together with the **Cloud Admin Guide** content to create a new **Administrator Guide**.
id: Reorganises konten **Admin User Guide** bersama-sama dengan konten **Cloud Admin Guide** untuk membuat **Administrator Guide** baru.

source: Reorganized and rewrote the deployment examples using "building blocks" to improve usability and understanding. After choosing either the Linux bridge or Open vSwitch mechanism driver, the audience can deploy increasingly complex architectures that build on prior simpler examples. Also reduced duplication of content.
id: Organisasi ulang dan menulis ulang dimana contoh penyebaran menggunakan "building blocks" untuk meningkatkan kegunaan dan pemahaman. Setelah pemilihan salah satu Linux bridge atau Open vSwitch mechanism driver, audience dapat meningkatkan pengerahan arsitektur kompleks yang membangun contoh lebih sederhana dari sebelumnya. Juga mengurangi duplikasi konten.

source: Reorganized the Administrator Guide Telemetry chapter to improve information architecture.
id: Organisasi ulang bab Administrator Guide Telemetry untuk meningkatkan arsitektur informasi.

source: Replaced Keystone CLI examples with OpenStack CLI examples.
id: Diganti contoh Keystone CLI dengan contoh OpenStack CLI.

source: Replaced basic node and service installation instructions with links.
id: Diganti basic node dan layanan instruksi instalasi dengan link.

source: Rework of 'node hardening' section
id: Pengerjaan ulang bagian 'node hardening'
